Revit 2027 API
MEPSection.TotalCoefficient Property
 The loss coefficient of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalCoefficient { get; }
Public ReadOnly Property TotalCoefficient As Double
	Get
public:
property double TotalCoefficient {
	double get ();
}
member TotalCoefficient : float with get
Property Value
Double
Remarks
 It's total of all fittings and segments. Coefficient is a number. The unit type is UT_Number.
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace